app/Controllers/CStatus.php

SELECT *
FROM `tbl_transaksi`
SELECT *
FROM `tbl_transaksi`
WHERE `no_resi` = 'JB0054224977'
---
    function update_resi()
    {
        $getDataTransaksi = $this->modelTransaksi->findAll();

        foreach ($getDataTransaksi as $z) {
            $id         = $z["id_transaksi"];
            $inv        = $z["inv"];
            $resi       = $z["no_resi"];
            $date       = date('H:i:s', strtotime($z['updated_at']));
            $ekspedisi  = $z["ekspedisi"];

            $timeNow    = date('H:i:s', strtotime($z['updated_at']) + 60 * 60);

            if($z['status_hub']==3){
                if ($timeNow > $date) {
                    if ($ekspedisi == 1) {
                        if ($z['status_pod'] != "DELIVERED") {
                            $getUpdate = $this->modelTransaksi->jnt($resi);
                            $jumlahArray = count($getUpdate->history) - 1;
                            $awb        = isset($getUpdate->awb) ? $getUpdate->awb : "-";
                            $getID       = $this->modelTransaksi->getWhere(['no_resi' => $resi])->getRow();

UPDATE `tbl_transaksi` SET `status_pod` = '-', `desc` = 'Paket telah diterima', `update_resi` = '2023-03-21 01:41:35', `ongkir` = 9000, `updated_at` = '2023-03-23 17:15:42'
WHERE `tbl_transaksi`.`id_transaksi` IN ('15')
---
                                'update_resi'       => isset($getUpdate->history[0]->date_time) ? $getUpdate->history[0]->date_time : "-",
                                'ongkir'            => isset($getUpdate->detail->actual_amount) ? $getUpdate->detail->actual_amount : "-",
                            ];
                            $this->modelTransaksi->update($getID->id_transaksi, $data);

SELECT *
FROM `tbl_transaksi`
WHERE `id_transaksi` = '15'
---
    public function modalTrack()
    {
        if ($this->request->isAJAX()) {
            $code = $this->request->getVar('id');
            $getCode = $this->modelTransaksi->getWhere(['id_transaksi' => $code])->getRow();