app/Models/MAgen.php

    public function getDatatables()
    {
        $this->getDatatablesQuery();
        if ($this->request->getPost('length') != -1)
            $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
        $query = $this->dt->get();
---
SELECT *
FROM `tbl_agen`
ORDER BY `created_at` DESC
 LIMIT 10

    public function countFiltered()
    {
        $this->getDatatablesQuery();
        return $this->dt->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_agen`

    public function countAll()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_agen`