app/Models/MCustomer.php

SELECT *
FROM `tbl_customer`
WHERE `desc_cust` = 'Warehouse'
---
    public function listWarehouse($desc)
    {
        $list = $this->dt->where('desc_cust',$desc)->get();