app/Models/MTransaksi.php

    public function countAll()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_transaksi`